Console.Clear();


// Создание функции
void GenerateArray(int[] array)
{
    for(int i = 0; i < riceitem.Length; i++)
}
int[] arrayLength = new int = 10;
int[] riceitem = new int[arrayLength];

for(int i = 0; i < riceitem.Length; i++)
{
    riceitem[i] = new Random().Next(1, arrayLength);
    Console.Write($" [{i}]: {riceitem[i]},");
}


// Дано число. Проверить кратно ли оно 7 и 23
// Дано число обозначающее день недели. Выяснить является номер дня недели выходным
// По двум заданным числам проверять является ли одно квадратом другого
// Проверить истинность утверждения ¬(X ⋁ Y) = ¬X ⋀ ¬Y
// Определить номер четверти плоскости, в которой находится точка с координатами Х и У, причем X ≠ 0 и Y ≠ 0
// Задать номер четверти, показать диапазоны для возможных координат
// Программа проверяет пятизначное число на палиндромом.
// Найти расстояние между точками в пространстве 2D/3D