Console.Clear();

// Вывести квадрат числа

// int a = 5;
// int b = 3;
// Console.WriteLine(Math.Pow(a, b));

// По двум заданным числам проверять является ли первое квадратом второго



// Даны два числа. Показать большее и меньшее число

// int a = 5;
// int b = 25;
// int max = a;
// if(b > a) max = b;
// Console.WriteLine(max);

// // По заданному номеру дня недели вывести его название
// int[] week = {Понедельник, вторник, среда, четверг, пятница, суббота, воскресенье};


// Найти максимальное из трех чисел
// Написать программу вычисления значения функции y = f(a)
// Выяснить является ли число чётным
// Показать числа от -N до N
// Показать четные числа от 1 до N
// Показать последнюю цифру трёхзначного числа
// Показать вторую цифру трёхзначного числа
// Дано число из отрезка [10, 99]. Показать наибольшую цифру числа
// Удалить вторую цифру трёхзначного числа
// Выяснить, кратно ли число заданному, если нет, вывести остаток.
// Найти третью цифру числа или сообщить, что её нет