Console.Clear();

// Выяснить является ли вещественное m
// целой степенью числа 3 // выполнено.
// корнем целой степени из 5 // нет
// синусом угла кратного 45 градусам // нет

// bool isAnIntegerPowerOfNumber(double numberDouble, int number)
// {
//     bool result = false;
//     if((int)numberDouble % number == 0)
//     {
//         result = true;
//     }
//     return result;
// }

// Console.WriteLine("Введите число: ");
// string numberStr = Console.ReadLine() ?? "";
// double numberDouble = Convert.ToDouble(numberStr.Replace('.', ','));
// int number = 3;
// bool anIntegerPowerOfNumber = isAnIntegerPowerOfNumber(numberDouble, number);
// string isAnIntegerPowerOfNumberStr = (anIntegerPowerOfNumber) ? "" : "не";
// Console.WriteLine($"Число {numberDouble} {isAnIntegerPowerOfNumberStr} является целой степенью числа {number}");

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Показать таблицу квадратов чисел от 1 до N


// Найти кубы чисел от 1 до N
// Console.WriteLine("Введите число");
// int N = Convert.ToInt32(Console.ReadLine());
// for (int i = 0; i < N; i++)
// {
//     double kub = Math.Pow(i, 3);
//     System.Console.WriteLine($"[{i}] = {kub}");
// }
/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Найти сумму чисел от 1 до А
// Console.WriteLine("Введите число");
// int A = Convert.ToInt32(Console.ReadLine());
// int sum = 0;
// for (int i = 1; i <= A; i++)
// {
//     sum = sum + i;
// }
// Console.WriteLine($"Сумма чисел {sum}");

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Возведите число А в натуральную степень B используя цикл
// Console.WriteLine("Введите число");
// int A = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine("Введите степень");
// int B = Convert.ToInt32(Console.ReadLine());
// int result = 1;
// for (int i = 0; i < B; i++)
// {
//     result = result*A;
// }
// Console.WriteLine($"Ответ: {result}");

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Определить количество цифр в числе



/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Подсчитать сумму цифр в числе

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Написать программу вычисления произведения чисел от 1 до N

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// Показать кубы чисел, заканчивающихся на четную цифру

/////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////